In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [17]:
randn(3,3)

array([[-0.82868792, -0.17161702,  1.4516174 ],
       [-2.87111802, -0.40736784, -0.55836051],
       [ 1.04670884,  0.66666953, -1.17604349]])

In [18]:
df =pd.DataFrame(data = randn(3,3),index=["A","B","C"],columns=["Column1","Column2","Column3"])

In [19]:
df

    Column1   Column2   Column3
A -0.881493 -2.115721 -1.770739
B -0.582746  0.372743  0.434282
C  0.918906  0.483398  1.127568

In [20]:
df["Column1"]

A   -0.881493
B   -0.582746
C    0.918906
Name: Column1, dtype: float64

In [21]:
df["Column2"]

A   -2.115721
B    0.372743
C    0.483398
Name: Column2, dtype: float64

In [22]:
df["Column3"]

A   -1.770739
B    0.434282
C    1.127568
Name: Column3, dtype: float64

In [23]:
type(df["Column1"])

pandas.core.series.Series

In [26]:
df.loc["A"]

Column1   -0.881493
Column2   -2.115721
Column3   -1.770739
Name: A, dtype: float64

In [27]:
df[["Column1","Column3"]]

    Column1   Column3
A -0.881493 -1.770739
B -0.582746  0.434282
C  0.918906  1.127568

In [32]:
df["Column4"]=pd.Series(randn(3),["A","B","C"])

In [33]:
df

    Column1   Column2   Column3   Column4
A -0.881493 -2.115721 -1.770739  0.775176
B -0.582746  0.372743  0.434282 -1.620784
C  0.918906  0.483398  1.127568  1.613990

In [34]:
df["Column5"]=df["Column1"]+df["Column2"]+df["Column3"]

In [35]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.881493 -2.115721 -1.770739  0.775176 -4.767952
B -0.582746  0.372743  0.434282 -1.620784  0.224279
C  0.918906  0.483398  1.127568  1.613990  2.529872

In [38]:
df.drop("Column5",axis=1)

    Column1   Column2   Column3   Column4
A -0.881493 -2.115721 -1.770739  0.775176
B -0.582746  0.372743  0.434282 -1.620784
C  0.918906  0.483398  1.127568  1.613990

In [39]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.881493 -2.115721 -1.770739  0.775176 -4.767952
B -0.582746  0.372743  0.434282 -1.620784  0.224279
C  0.918906  0.483398  1.127568  1.613990  2.529872

In [40]:
df.drop("Column5",axis=1,inplace=True)

In [41]:
df

    Column1   Column2   Column3   Column4
A -0.881493 -2.115721 -1.770739  0.775176
B -0.582746  0.372743  0.434282 -1.620784
C  0.918906  0.483398  1.127568  1.613990

In [42]:
df.loc["A"]

Column1   -0.881493
Column2   -2.115721
Column3   -1.770739
Column4    0.775176
Name: A, dtype: float64

In [43]:
df.iloc[0]

Column1   -0.881493
Column2   -2.115721
Column3   -1.770739
Column4    0.775176
Name: A, dtype: float64

In [44]:
df.iloc[1]

Column1   -0.582746
Column2    0.372743
Column3    0.434282
Column4   -1.620784
Name: B, dtype: float64

In [45]:
df.iloc[2]

Column1    0.918906
Column2    0.483398
Column3    1.127568
Column4    1.613990
Name: C, dtype: float64

In [47]:
df.loc["A","Column1"]

-0.8814927529810779

In [48]:
df.loc["C","Column2"]

0.48339811617301176

In [49]:
df.loc[["A","B"],["Column1","Column2"]]

    Column1   Column2
A -0.881493 -2.115721
B -0.582746  0.372743